## Import Library

In [2]:
import pandas as pd

## Create Pandas DataFrame

In [4]:
df1=pd.DataFrame({'Dates' :['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06'] ,\
                'ID': [1,2,3,4,5,6]})

df2=pd.DataFrame({'Names':['A','B','C','D','E','F'],\
                  'ID':[4,5,6,7,9,8],\
                'Designation':['Manager','Employee','CEO','CTO','Manager','Employee']})

In [5]:
df1

        Dates  ID
0  2020-01-01   1
1  2020-01-02   2
2  2020-01-03   3
3  2020-01-04   4
4  2020-01-05   5
5  2020-01-06   6

In [6]:
df2

  Names  ID Designation
0     A   4     Manager
1     B   5    Employee
2     C   6         CEO
3     D   7         CTO
4     E   9     Manager
5     F   8    Employee

## Select Specific Columns in Pandas DataFrame

In [7]:
df2[['ID','Names']]

   ID Names
0   4     A
1   5     B
2   6     C
3   7     D
4   9     E
5   8     F

## Select Rows in Pandas DataFrame

In [6]:
df2[:3]

  Names  ID Designation
0     A   4     Manager
1     B   5    Employee
2     C   6         CEO

## Select Specific Rows and Columns using loc in Pandas DataFrame

In [30]:
df2.loc[4:6,['Names']]

  Names
4     E
5     F

## Select Specific rows using iloc

In [17]:
df2.iloc[3:5]

  Names  ID Designation
3     D   7         CTO
4     E   9     Manager

## Filter DataFrame using Specific Condition

In [33]:
df2[df2['Designation']=='Manager']

  Names  ID Designation
0     A   4     Manager
4     E   9     Manager